ltowarek/esp-opentelemetry-cpp/examples/profiling/otlp/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_FREERTOS_HZ=1000

CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MODE_OCT=y

# OpenTelemetry tracing + its protobuf/Abseil dependencies blow past the
# stock "single app large" 1.5 MB factory partition. Grow flash to 4 MB
# and switch to a custom layout with a ~3.25 MB factory slot.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=32768

# Tracing gives the spans that span profiles link to; profiling samples the
# CPU. The per-task span slot needs a second FreeRTOS TLS pointer.
CONFIG_ESP_OPENTELEMETRY_TRACING_ENABLED=y
CONFIG_ESP_OPENTELEMETRY_TRACING_OTLP_BASE_URL=""
CONFIG_ESP_OPENTELEMETRY_PROFILING_ENABLED=y
CONFIG_ESP_OPENTELEMETRY_PROFILES_OTLP_BASE_URL=""
CONFIG_ESP_OPENTELEMETRY_PROFILING_EXPORT_INTERVAL_MS=2000
CONFIG_ESP_OPENTELEMETRY_SERVICE_NAME="profiling-otlp-example"
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=2

CONFIG_WIFI_SSID=""
CONFIG_WIFI_PASSWORD=""
